import GuideBox from "../GuideBox/Guidebox";
import "./Empty.css";

export default function Empty() {
  return (
    <div className="empty">
      <GuideBox />
      <div className="empty-icon">
        <svg xmlns="http://www.w3.org/2000/svg" width="110" height="110" viewBox="0 0 110 110" fill="none">
          <path d="M41.25 45.8333H41.2958M68.75 45.8333H68.7958M41.25 68.75H68.75M13.75 55C13.75 60.417 14.817 65.781 16.89 70.7857C18.963 75.7904 22.0014 80.3377 25.8318 84.1682C29.6623 87.9986 34.2096 91.037 39.2143 93.11C44.219 95.183 49.583 96.25 55 96.25C60.417 96.25 65.781 95.183 70.7857 93.11C75.7904 91.037 80.3377 87.9986 84.1682 84.1682C87.9986 80.3377 91.037 75.7904 93.11 70.7857C95.183 65.781 96.25 60.417 96.25 55C96.25 49.583 95.183 44.219 93.11 39.2143C91.037 34.2096 87.9986 29.6623 84.1682 25.8318C80.3377 22.0014 75.7904 18.963 70.7857 16.89C65.781 14.817 60.417 13.75 55 13.75C49.583 13.75 44.219 14.817 39.2143 16.89C34.2096 18.963 29.6623 22.0014 25.8318 25.8318C22.0014 29.6623 18.963 34.2096 16.89 39.2143C14.817 44.219 13.75 49.583 13.75 55Z" stroke="#D1D1D1" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
      </div>

      <div className="empty-title">비어있음</div>
      <div className="empty-desc">
        스크랩 할 텍스트를 드래그해보세요
      </div>
    </div>
  );
}
